<?php
$lang = [
	'pass' => 'Введите пароль',
	'enter' => 'Войти',
	'logout' => 'Выйти',
	'wrongpass' => 'Неверный пароль',
	'nopass' => 'Пароль не задан в config.php',
	'inputurl' => 'Полный URL страницы сайта или папка на сервере…',
	'optimize' => 'Оптимизировать',
	'children' => 'Сканировать дочерние папки',

	'nocurl' => 'Расширение cURL не установлено',
	'noauth' => 'Вы не авторизованы',
	'noscript' => 'Скрипт по адресу "<b>%s</b>" не найден',
	'nourl' => 'Не указан URL',
	'wronghost' => 'Неверный хост',
	'gpserror' => 'Ошибка подключения к Google PageSpeed: [ERR]',
	'errzip' => 'Ошибка распаковки ZIP',
	'noimages' => 'Новых изображений для оптимизации не найдено',
	'otherdirs' => 'Папка image содержит другие папки',
	'nomanifest' => 'Файл MANIFEST не найден в полученном архиве',
	'nofile' => 'Упс, файл "<b>%s</b>" в архиве почему-то не найден :(',
	'noorig' => 'Оригинальный файл "%s" не найден в папке назначения',
	'errmove' => 'Ошибка перемещения файла "<b>%s</b>"',
	'diffres' => 'Разрешение нового изображения "<b>[FN]</b>" ([WF]x[HF]) отличается от оригинального ([WT]x[HT])',
	'welldone' => 'Готово! [R]/[T] файлов заменено ([TIME]s)',
	'reported' => 'Репорт отправлен разработчику',

	'wrongtoken' => 'Неверный токен',
	'wrongpath' => 'Введите относительный путь!<br>Пример: /images/.../конечная_папка_с_изображениями',
	'nodir' => 'Директория "<b>%s</b>" не существует'
];